  # THE PRICE IS RIGHT

In [1]:
import pandas as pd

In [2]:
import sqlite3

In [3]:
import glob

In [4]:
import os.path

In [5]:
import io

## import Showcase data from Excel

In [6]:
ShowcaseStats = pd.read_csv("https://raw.githubusercontent.com/koryvette/python/master/project/Showcase_spin.csv")

In [7]:
ShowcaseStats.head()

   Season  First spinner won  Second spinner won  Third spinner won
0      29                 92                 115                121
1      30                 93                 133                124
2      31                103                 129                118
3      32                106                 114                130
4      33                119                 106                125

## read to SQLite

In [8]:
import sqlite3

In [9]:
con = sqlite3.connect('priceright.db')

In [10]:
df_win = pd.read_csv('https://raw.githubusercontent.com/koryvette/python/master/project/output.csv')

In [11]:
df_win.head()

   season                 game  win  loss
0      29           Any_Number   12    15
1      29         Balance_Game    0     0
2      29  Barkers_Bargain_Bar   23     8
3      29      Barkers_MarkerS    3     5
4      29              Bonkers    0     0

In [12]:
df_win.to_sql('Games',con, if_exists='replace')

In [13]:
results = con.execute('SELECT Season, sum(Win), sum(Loss) from Games'\
                       ' GROUP BY Season')
for row in results:
    print(row)

(29, 948, 1020)
(30, 1042, 1058)
(31, 1000, 1100)
(32, 1030, 1070)
(33, 1036, 1064)
(34, 1000, 1100)
(35, 1000, 1100)
(36, 1068, 1212)
(37, 920, 1372)
(38, 830, 1450)
(39, 796, 1484)
(40, 900, 1392)
(41, 970, 1298)
(42, 974, 1306)
(43, 1050, 1230)
(44, 1056, 1214)
(45, 1048, 1230)
(46, 1024, 1256)

In [42]:
win_pct = con.execute('SELECT Season, sum(Win) AS WINS, sum(Loss), sum(Win) + sum(Loss) AS [Total_Games_Played], (Sum(Win)/(sum(Win) + sum(Loss))) AS [PCT] from Games'\
                       ' GROUP BY Season')
for row in win_pct:
    print(row)

(29, 948, 1020, 1968, 0)
(30, 1042, 1058, 2100, 0)
(31, 1000, 1100, 2100, 0)
(32, 1030, 1070, 2100, 0)
(33, 1036, 1064, 2100, 0)
(34, 1000, 1100, 2100, 0)
(35, 1000, 1100, 2100, 0)
(36, 1068, 1212, 2280, 0)
(37, 920, 1372, 2292, 0)
(38, 830, 1450, 2280, 0)
(39, 796, 1484, 2280, 0)
(40, 900, 1392, 2292, 0)
(41, 970, 1298, 2268, 0)
(42, 974, 1306, 2280, 0)
(43, 1050, 1230, 2280, 0)
(44, 1056, 1214, 2270, 0)
(45, 1048, 1230, 2278, 0)
(46, 1024, 1256, 2280, 0)

In [16]:
con.execute('SELECT * from Games')

In [20]:
df_showcase = pd.read_csv('https://raw.githubusercontent.com/koryvette/python/master/project/Showcase_spin.csv')

In [21]:
df_showcase.to_sql('Showcase',con, if_exists='replace')

C:\Users\79kor\Anaconda3\lib\site-packages\pandas\core\generic.py:2127: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  dtype=dtype)

DatabaseError: Execution failed on sql 'DROP TABLE "Showcase"': database table is locked

In [23]:
df_showcase.head()

   Season  First spinner won  Second spinner won  Third spinner won
0      29                 92                 115                121
1      30                 93                 133                124
2      31                103                 129                118
3      32                106                 114                130
4      33                119                 106                125

In [78]:
con.close()

## import Winners data from Excel

In [29]:
WinnerStats = pd.read_csv("https://raw.githubusercontent.com/koryvette/python/master/project/Game_stats_Win.csv")

In [30]:
WinnerStats.head()

,Season,Any Number,Balance Game,Barker's Bargain Bar,Barker's Marker$,Bonkers,Bonus Game,Bullseye,Buy or Sell,Card Game,...,Switcheroo,Take Two,Temptation,10 Chances,That's Too Much!,3 Strikes,Time is Money,Triple Play,2 for the Price of 1,Vend-O-Price
0,29,12,0,23,3,0,4,9,7,4,...,4,4,5,10,4,1,0,1,1,0
1,30,11,0,21,5,11,5,10,4,5,...,0,5,1,4,7,1,0,1,4,0
2,31,8,0,24,5,10,2,12,6,5,...,4,6,3,8,8,3,0,2,2,0
3,32,5,0,18,3,6,8,9,7,3,...,3,3,2,7,9,1,11,2,4,0
4,33,9,0,15,3,7,8,8,4,3,...,1,5,3,3,6,4,0,1,5,0

## import Losers data from Excel

In [45]:
LoserStats = pd.read_csv("https://raw.githubusercontent.com/koryvette/python/master/project/Game_stats_Loss.csv")

In [46]:
LoserStats.head()

,Season,Any Number,Balance Game,Barker's Bargain Bar,Barker's Marker$,Bonkers,Bonus Game,Bullseye,Buy or Sell,Card Game,...,Switcheroo,Take Two,Temptation,10 Chances,That's Too Much!,3 Strikes,Time is Money,Triple Play,2 for the Price of 1,Vend-O-Price
0,29,15,0,8,5,0,2,4,1,14,...,8,2,7,3,2,2,0,7,5,0
1,30,12,0,8,2,11,0,2,3,12,...,11,2,9,5,18,4,0,5,2,0
2,31,14,0,7,2,6,4,2,1,9,...,7,2,6,4,18,5,0,6,7,0
3,32,20,0,13,4,9,1,2,0,11,...,6,3,8,4,14,6,4,5,3,0
4,33,16,0,10,3,5,1,2,2,14,...,8,1,6,9,17,4,0,5,1,0

In [24]:
import numpy as np
import matplotlib.pyplot as plt
plt.ylabel('Season')
plt.xlabel('Showcase Spinner position')

plt.plot(ShowcaseStats)

[<matplotlib.lines.Line2D at 0x26e54214fd0>,
 <matplotlib.lines.Line2D at 0x26e54222160>,
 <matplotlib.lines.Line2D at 0x26e542222b0>,
 <matplotlib.lines.Line2D at 0x26e54222400>]

In [ ]:
ef main():
    database = "C:\Users\79kor\priceisright.db"
 
    sql_create_projects_table = """ CREATE TABLE IF NOT EXISTS projects (
                                        id integer PRIMARY KEY,
                                        name text NOT NULL,
                                        begin_date text,
                                        end_date text
                                    ); """